[
  {
    "user_id": 1,
    "dish": "Asparagus, Mushroom, Leek, and Cheese Galette",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "user_name": "Daniel Gritzer",
    "prepTime": "2 hr 30 mins",
   "nutrition_facts":"268 calories, 8g fat (3g saturated fat), 83mg cholesterol, 560mg sodium, 6g carbohydrate (5g sugars, 0 fiber), 40g protein.",
    "dishDesc": "A crispy, flaky, and buttery free-form crust wraps around a savory filling of spring ingredients—tender asparagus, melted leeks, and earthy mushrooms, with Fontina cheese tying everything together.",
    "ingredients": "1/2 batch Old-Fashioned Flaky Pie Dough, 1/4 cup plus 1 tablespoon (75ml) extra-virgin olive oil, divided, plus more for drizzling , 1 pound (450g) mixed mushrooms, such as cremini, stemmed and caps sliced 1/4 inch thick, Kosher salt, 1 pound (450g) asparagus, woody ends trimmed, stalks cut on the bias 1/4 inch thick, tips reserved, 1 teaspoon minced fresh thyme leaves, 1 1/2 pounds leeks, white and light green parts only, halved lengthwise then cut crosswise into 1/4 inch thick half-moons, 2 ounces (55g) grated Fontina cheese , 1 large egg, beaten",
    "directions1": "Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24. In a large sauté pan or cast iron skillet, heat 4 tablespoons (60ml) olive oil over medium-high heat until shimmering. Add mushrooms and cook, stirring occasionally, until browned, about 6 minutes.",
    "directions2": "Stir in asparagus stalks, thyme, and the remaining 1 tablespoon (15ml) olive oil. Lower heat to medium and cook, tossing and stirring, until asparagus is tender, about 8 minutes. Add 3 tablespoons (45ml) water to skillet, scraping up browned bits from bottom of pan. Season with salt and remove from heat. Meanwhile, in a large saucepan, melt butter over medium heat until foaming. Add leeks and cook, stirring, until very soft, about 8 minutes. Lower heat if necessary to prevent browning. Season with salt.",
    "directions3": "Add the leeks to the asparagus mixture along with the cheese and stir to combine. Adjust oven rack to lower-middle position and preheat to 400°F. Spread asparagus-leek mixture on prepared dough round, leaving about a 2-inch border of dough all around. With a sharp knife, cut a series of slits in the border of dough, each running from filling to edge of dough, spacing them about 5 inches apart. Fold each segment of dough over filling, tugging gently so the edge of each segment tightly overlaps the one that came before. Chill galette for 10 minutes in the refrigerator.",
    "directions4": "In a small bowl, drizzle reserved asparagus tips with olive oil, season with salt, and toss to coat lightly and evenly. Arrange asparagus tips on top of exposed filling in center of the galette. Brush egg over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together. Bake until galette is golden brown around the edges and bubbling in the center, about 45 minutes longer. Let cool 5 minutes, then slice into wedges and serve warm."
    },
  {
    "user_id": 2,
    "dish": "Lemony Broiled Potatoes With Halloumi Cheese",
    "dishPic": "/images/broiling-potato-haloumi.webp",
    "user_name": "Michael Harlan Turkell",
    "prepTime": "30 mins",
    "nutrition_facts": "89 calories, 1g fat (0 saturated fat), 0 cholesterol, 149mg sodium, 17g carbohydrate (3g sugars, 1g fiber), 2g protein. Diabetic Exchanges: 1 starch.",
    "dishDesc": "Browned on top, creamy on bottom, and bright with lemon, these broiled potatoes topped off with melty halloumi cheese combine the best of roast potatoes and gratin.",
    "ingredients": "2 tablespoons (30 ml) extra-virgin olive oil, 1 pound (450 g) Yukon Gold potatoes, sliced 1/8 inch thick, 1/4 cup (60 ml) fresh lemon juice, from about 1 lemon, plus zest of 1 lemon, 8 ounces (225 g) halloumi cheese, thinly sliced, 2 teaspoons dried oregano, Kosher or sea salt, Freshly ground black pepper",
    "directions1": "Preheat broiler and set top oven rack about 6 inches from broiler element. Add olive oil to a 12-inch cast iron skillet and spread evenly all over. Add potatoes, shingling the slices around the pan in a single circular layer. Season with salt and pepper.",
    "directions2": "Broil until the potatoes have puffed up slightly, mostly cooked through, and browned on top, about 7 minutes.",
    "directions3": "Pour lemon juice all over potatoes and sprinkle zest on top. Add halloumi cheese in an even layer on top and broil until cheese is golden brown all over and potatoes are fully cooked through, about 4 minutes.",
    "directions4": "Sprinkle oregano on top and serve."
  },
  {
    "user_id": 3,
    "dish": "Carciofi alla Romana: The Other Delicious Roman Artichoke Dish",
    "dishPic": "/images/artichokes-ala-romana.webp",
    "user_name": "Daniel Gritzer",
    "prepTime": "60 mins",
    "nutrition_facts": " 130 calories, 4g fat (1g saturated fat), 25mg cholesterol, 111mg sodium, 21g carbohydrate (10g sugars, 1g fiber), 3g protein.",
    "dishDesc": "Braised Roman-style artichokes are cooked gently in a mixture of white wine, olive oil, garlic, and herbs.",
    "ingredients": "2 whole lemons (for maintaining artichokes' color), 4 large or 12 small artichokes (2 pounds; 1kg), 1/4 cup (7g) minced flat-leaf parsley leaves, 2 tablespoons minced fresh mint leaves, 2 tablespoons minced fresh oregano leaves, 3 medium cloves garlic, minced, 1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling, 1/4 cup (60ml) dry white wine, Kosher salt and freshly ground black pepper",
    "directions1": "Fill a large bowl with water; halve and squeeze 2 lemons into it. Trim artichokes by cleaning them down to the hearts, following the guidelines shown here: Using a serrated knife, cut off top of artichoke and bottommost part of stem. Using a paring knife or sharp vegetable peeler, trim away the tough outer leaves to expose the tender inner leaves and heart. Trim away fibrous outer layer around stem to expose tender inner core (if stem breaks off, that's okay; just save it and cook it alongside the hearts). Using a spoon, scrape out the inedible, hairy choke in the center of each heart. Transfer cleaned artichokes to bowl of lemon water as you work, covering them with a clean kitchen towel to keep them completely submerged.",
    "directions2": "In a small bowl, stir together parsley, mint, oregano, and garlic. Rub concave side of each artichoke heart with herb mixture, packing it into any leafy crevices. Set aside remaining herb mixture.",
    "directions3": "Add olive oil and wine to a pot just large enough to hold all the artichokes closely side by side, so that they can sit flat with their stem sides up. Arrange artichokes in pot and season with salt and pepper. Bring pot to a simmer over medium-high heat, then lower heat to a bare simmer, cover, and cook until artichokes are fork-tender, 20 to 30 minutes. (Smaller artichokes may not take as long.)",
    "directions4": "Remove from heat and transfer artichokes to a platter, stem sides up. Drizzle with cooking juices, along with some fresh olive oil and a light sprinkling of reserved herb mixture. Serve warm or at room temperature."
  },  
  {
    "user_id": 4,
    "dish": "Grilled Oysters Recipe",
    "dishPic": "/images/grilled-oysters.webp",
    "user_name": "J. Kenji López-Alt",
    "prepTime": "30 mins",
    "nutrition_facts": "550 calories, 33g fat (19g saturated fat), 202mg cholesterol, 179mg sodium, 60g carbohydrate (37g sugars, 2g fiber), 6g protein.",
    "dishDesc": "I am an East Coast oyster fiend, but I can't abide West Coast oysters served raw. So, when a buddy of mine recently gave me a whole case of gorgeous Kusshi oysters from British Columbia for helping him out.",
    "ingredients": "16 whole live oysters, 2 cloves garlic, finely minced, 3 tablespoons extra virgin olive oil, 3 tablespoons unsalted butter, 1 teaspoon lemon juice, 1/2 teaspoon chili pepper flakes (or substitute with dashes of Tabasco), 1/4 teaspoon salt, Freshly ground black pepper, to taste, 1 tablespoon finely minced parsley",
    "directions1": "Preheat grill to 450°. Pulse first 8 ingredients in a food processor until well combined.",
    "directions2": "Arrange oysters in a single layer on grill. Spoon 2 tsp. butter mixture into each oyster; grill, uncovered, 7 minutes or until edges curl.",
    "directions3": "Broiled Oysters: Preheat broiler with oven rack 3 inches from heat. Prepare recipe as directed, placing oysters in a single layer in a jelly-roll pan. Broil 4 minutes or until edges curl and butter drips over the shell.",
    "directions4": "If you are a shuckmeister: Shuck the oysters, spoon a little sauce in each oyster. Place oysters on a very hot, preheated grill, cover and cook for 5-6 minutes or until the edges of oysters curl slightly."
    
  },
  {
    "user_id": 5,
    "dish": "Charred Asparagus With Miso Béarnaise Sauce Recipe",
    "dishPic": "/images/asparagus-miso-bearnaise.webp",
    "user_name": "Sasha Marx",
    "prepTime": "40 mins",
    "nutrition_facts": "416 calories, 19g fat (4g saturated fat), 86mg cholesterol, 698mg sodium, 26g carbohydrate (2g sugars, 2g fiber), 32g protein. Diabetic Exchanges: 5 lean meat, 1-1/2 starch.",
    "dishDesc": "A touch of miso and a screaming-hot cast iron pan spruce up these classic steakhouse accoutrements.",
    "ingredients": "1/2 cup (120 ml) dry white wine, 1/4 cup (60 ml) white wine vinegar, 1 large shallot (30 g), sliced thin, 3 sprigs tarragon, leaves finely minced, stems reserved separately, 1/2 teaspoon (2 g) whole black peppercorns, 2 large egg yolks (36 g), 1 tablespoon (20 g) white miso, 12 tablespoons (168 g) unsalted butter, 1 pound (450 g) asparagus, woody ends trimmed, 1 tablespoon (15 ml) vegetable oil, divided, Kosher salt and freshly ground black pepper",
    "directions1": "In a small saucepan, combine wine, vinegar, shallots, tarragon stems, and black peppercorns, and bring to a simmer over medium-high heat. Adjust heat to maintain a gentle simmer and cook until reduced to about 1 1/2 tablespoons of liquid, 10 to 12 minutes. Carefully strain liquid through a fine-mesh strainer into a small bowl, pressing on the solids with the back of a spoon to extract as much liquid as possible. Let mixture cool slightly. In a tall-sided cup that barely fits the head of an immersion blender, combine egg yolks, miso, and the wine-vinegar reduction. Using an immersion blender. Blend mixture until well-combined, about 30 seconds.",
    "directions2": "Meanwhile, in a small saucepan, melt butter over high heat, swirling constantly, until foaming subsides. Transfer butter to a 1-cup liquid measuring cup. Heat a large cast iron skillet over high heat.",
    "directions3": "Place head of immersion blender into the bottom of the cup and turn it on. With the blender constantly running, slowly pour hot butter into cup in a thin and steady stream. Continue blending, raising and lowering blender head slightly to fully emulsify butter with the egg yolk mixture. Sauce should be thick and creamy, able to coat a spoon but still flow off of it. If it is too thick, whisk in a small amount of water to thin it out. Stir in minced tarragon and season to taste with salt. Transfer to a small lidded pot and keep in a warm place for up to 1 hour before serving. Béarnaise cannot be cooled and reheated.",
    "directions4": "Add half of the asparagus to the preheated cast iron skillet and arrange in a single layer. Cook, turning occasionally, until spears are lightly charred all over and just cooked through, 4 to 6 minutes for thin spears, 5 to 8 minutes for thick spears. Carefully add half of the vegetable oil to the skillet, toss to coat asparagus with oil, and season with salt and pepper to taste. Transfer asparagus to a warmed serving plate. Repeat with remaining asparagus and vegetable oil. Serve immediately, passing béarnaise sauce at the table."
  },  
  {
    "user_id": 6,
    "dish": "Mashed Potatoes",
    "dishPic": "/images/mashed-potatoes.webp",
    "user_name": "Millie Tsai",
    "prepTime": "25 mins",
    "nutrition_facts": "416 calories, 19g fat (4g saturated fat), 86mg cholesterol, 698mg sodium, 26g carbohydrate (2g sugars, 2g fiber), 32g protein. Diabetic Exchanges: 5 lean meat, 1-1/2 starch.",
    "dishDesc": "Presenting my all-time favorite mashed potatoes recipe! These homemade mashed potatoes are perfectly rich and creamy, full of great flavor, easy to make, and always a crowd fave.",
    "ingredients": "Potatoes, Garlic, Butter, Milk, Cream Cheese, Fine sea salt, Toppings (Optional)",
    "directions1": "Use a blend of potatoes, and avoid waterlogging your potatoes.",
    "directions2": "In general, you want to stir the liquids into your mashed potatoes until they are just combined. Otherwise if you overmix, they can crossover into gummy territory, which is no good.",
    "directions3": "We will use fine sea salt to season the potatoes both (1) in the water while they are boiling and (2) afterwards, when adding in the butter, milk and cream cheese. As always when seasoning a recipe, taste-taste-taste along the way while you are preparing the recipe, and add more salt as needed.",
    "directions4": "It’s a worthy utensil to have in your kitchen! I own and recommend this OXO masher, especially if you like slightly chunky mashed potatoes. Or this smooth OXO masher, if you prefer smoother mashed potatoes. (Both are Amazon affiliate links.)"
  }
]